zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxw/pinctrl/MCXW70ACMFT-pinctrl.h
/*
 * Copyright 2026 NXP
 * SPDX-License-Identifier: Apache-2.0
 *
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXW70ACMFT/signal_configuration.xml
 *
 *
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXW70ACMFT_
#define _ZEPHYR_DTS_BINDING_MCXW70ACMFT_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0xF) << 8))

#define ADC0_A0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define TPM1_CLKIN_PTA0 KINETIS_MUX('A',0,5) /* PTA_0 */
#define TRGMUX0_IN1_PTA0 KINETIS_MUX('A',0,6) /* PTA_0 */
#define LPSPI2_SCK_PTA0 KINETIS_MUX('A',0,9) /* PTA_0 */
#define ADC0_A1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA_1 */
#define TPM1_CH0_PTA1 KINETIS_MUX('A',1,5) /* PTA_1 */
#define TRGMUX0_OUT1_PTA1 KINETIS_MUX('A',1,6) /* PTA_1 */
#define TDI_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define LPSPI2_SIN_PTA1 KINETIS_MUX('A',1,9) /* PTA_1 */
#define ADC0_A2_PTA2 KINETIS_MUX('A',2,0) /* PTA_2 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA_2 */
#define TPM1_CH1_PTA2 KINETIS_MUX('A',2,5) /* PTA_2 */
#define TRGMUX0_OUT2_PTA2 KINETIS_MUX('A',2,6) /* PTA_2 */
#define TDO_PTA2 KINETIS_MUX('A',2,7) /* PTA_2 */
#define SWO_PTA2 KINETIS_MUX('A',2,7) /* PTA_2 */
#define LPSPI2_SOUT_PTA2 KINETIS_MUX('A',2,9) /* PTA_2 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA_3 */
#define CMP0_OUT_PTA3 KINETIS_MUX('A',3,2) /* PTA_3 */
#define LPUART0_CTS_b_PTA3 KINETIS_MUX('A',3,3) /* PTA_3 */
#define RF_GPO_11_PTA3 KINETIS_MUX('A',3,4) /* PTA_3 */
#define SWD_DIO_PTA3 KINETIS_MUX('A',3,7) /* PTA_3 */
#define TMS_PTA3 KINETIS_MUX('A',3,7) /* PTA_3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define LPUART0_RTS_b_PTA4 KINETIS_MUX('A',4,3) /* PTA_4 */
#define RF_GPO_10_PTA4 KINETIS_MUX('A',4,4) /* PTA_4 */
#define TCLK_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define SWD_CLK_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define ADC0_A3_PTA5 KINETIS_MUX('A',5,0) /* PTA_5 */
#define CMP0_IN0_PTA5 KINETIS_MUX('A',5,0) /* PTA_5 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA_5 */
#define RF_GPO_9_PTA5 KINETIS_MUX('A',5,3) /* PTA_5 */
#define TRACE_SWO_PTA5 KINETIS_MUX('A',5,5) /* PTA_5 */
#define BOOT_CONFIG_PTA5 KINETIS_MUX('A',5,7) /* PTA_5 */
#define LPSPI2_PCS0_PTA5 KINETIS_MUX('A',5,9) /* PTA_5 */
#define ADC0_A4_PTA16 KINETIS_MUX('A',16,0) /* PTA_16 */
#define PTA16 KINETIS_MUX('A',16,1) /* PTA_16 */
#define LPSPI0_PCS0_PTA16 KINETIS_MUX('A',16,2) /* PTA_16 */
#define EWM0_OUT_b_PTA16 KINETIS_MUX('A',16,3) /* PTA_16 */
#define LPI2C0_SCLS_PTA16 KINETIS_MUX('A',16,4) /* PTA_16 */
#define LPUART0_RX_PTA16 KINETIS_MUX('A',16,6) /* PTA_16 */
#define RF_GPO_8_PTA16 KINETIS_MUX('A',16,7) /* PTA_16 */
#define PWM0_A0_PTA16 KINETIS_MUX('A',16,9) /* PTA_16 */
#define ADC0_A5_PTA17 KINETIS_MUX('A',17,0) /* PTA_17 */
#define PTA17 KINETIS_MUX('A',17,1) /* PTA_17 */
#define LPSPI0_SIN_PTA17 KINETIS_MUX('A',17,2) /* PTA_17 */
#define EWM0_IN_PTA17 KINETIS_MUX('A',17,3) /* PTA_17 */
#define LPI2C0_SDAS_PTA17 KINETIS_MUX('A',17,4) /* PTA_17 */
#define LPUART0_TX_PTA17 KINETIS_MUX('A',17,6) /* PTA_17 */
#define RF_GPO_7_PTA17 KINETIS_MUX('A',17,7) /* PTA_17 */
#define RF_GPO_8_PTA17 KINETIS_MUX('A',17,8) /* PTA_17 */
#define PWM0_B0_PTA17 KINETIS_MUX('A',17,9) /* PTA_17 */
#define RF_EXT_XTAL_REQUEST_PTA17 KINETIS_MUX('A',17,11) /* PTA_17 */
#define PTA18 KINETIS_MUX('A',18,1) /* PTA_18 */
#define LPSPI0_SOUT_PTA18 KINETIS_MUX('A',18,2) /* PTA_18 */
#define LPUART0_CTS_b_PTA18 KINETIS_MUX('A',18,3) /* PTA_18 */
#define LPI2C0_SDA_PTA18 KINETIS_MUX('A',18,4) /* PTA_18 */
#define RF_GPO_0_PTA18 KINETIS_MUX('A',18,6) /* PTA_18 */
#define PWM0_A1_PTA18 KINETIS_MUX('A',18,9) /* PTA_18 */
#define LPUART0_RX_PTA18 KINETIS_MUX('A',18,10) /* PTA_18 */
#define SPC0_LPREQ_PTA18 KINETIS_MUX('A',18,11) /* PTA_18 */
#define CMP0_IN1_PTA19 KINETIS_MUX('A',19,0) /* PTA_19 */
#define PTA19 KINETIS_MUX('A',19,1) /* PTA_19 */
#define LPSPI0_SCK_PTA19 KINETIS_MUX('A',19,2) /* PTA_19 */
#define LPUART0_RTS_b_PTA19 KINETIS_MUX('A',19,3) /* PTA_19 */
#define LPI2C0_SCL_PTA19 KINETIS_MUX('A',19,4) /* PTA_19 */
#define RF_GPO_1_PTA19 KINETIS_MUX('A',19,6) /* PTA_19 */
#define PWM0_B1_PTA19 KINETIS_MUX('A',19,9) /* PTA_19 */
#define CMP0_IN3_PTA20 KINETIS_MUX('A',20,0) /* PTA_20 */
#define ADC0_A6_PTA20 KINETIS_MUX('A',20,0) /* PTA_20 */
#define PTA20 KINETIS_MUX('A',20,1) /* PTA_20 */
#define LPSPI0_PCS2_PTA20 KINETIS_MUX('A',20,2) /* PTA_20 */
#define LPUART0_TX_PTA20 KINETIS_MUX('A',20,3) /* PTA_20 */
#define EWM0_IN_PTA20 KINETIS_MUX('A',20,4) /* PTA_20 */
#define RF_GPO_2_PTA20 KINETIS_MUX('A',20,6) /* PTA_20 */
#define PWM0_A2_PTA20 KINETIS_MUX('A',20,9) /* PTA_20 */
#define LPUART0_RTS_b_PTA20 KINETIS_MUX('A',20,11) /* PTA_20 */
#define ADC0_A7_PTA21 KINETIS_MUX('A',21,0) /* PTA_21 */
#define CMP0_IN2_PTA21 KINETIS_MUX('A',21,0) /* PTA_21 */
#define PTA21 KINETIS_MUX('A',21,1) /* PTA_21 */
#define LPSPI0_PCS3_PTA21 KINETIS_MUX('A',21,2) /* PTA_21 */
#define LPUART0_RX_PTA21 KINETIS_MUX('A',21,3) /* PTA_21 */
#define EWM0_OUT_b_PTA21 KINETIS_MUX('A',21,4) /* PTA_21 */
#define RF_GPO_3_PTA21 KINETIS_MUX('A',21,6) /* PTA_21 */
#define RF_GPO_7_PTA21 KINETIS_MUX('A',21,7) /* PTA_21 */
#define RF_GPO_10_PTA21 KINETIS_MUX('A',21,8) /* PTA_21 */
#define PWM0_B2_PTA21 KINETIS_MUX('A',21,9) /* PTA_21 */
#define LPUART0_CTS_b_PTA21 KINETIS_MUX('A',21,11) /* PTA_21 */
#define ADC0_A9_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define LPSPI1_PCS0_PTB0 KINETIS_MUX('B',0,2) /* PTB_0 */
#define TPM0_CH3_PTB0 KINETIS_MUX('B',0,5) /* PTB_0 */
#define HDI_PTB0 KINETIS_MUX('B',0,8) /* PTB_0 */
#define ADC0_A10_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define LPSPI1_SIN_PTB1 KINETIS_MUX('B',1,2) /* PTB_1 */
#define TPM0_CH4_PTB1 KINETIS_MUX('B',1,5) /* PTB_1 */
#define HDI_PTB1 KINETIS_MUX('B',1,8) /* PTB_1 */
#define ADC0_A11_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB_2 */
#define LPSPI1_SCK_PTB2 KINETIS_MUX('B',2,2) /* PTB_2 */
#define LPUART1_TX_PTB2 KINETIS_MUX('B',2,3) /* PTB_2 */
#define TPM0_CH5_PTB2 KINETIS_MUX('B',2,5) /* PTB_2 */
#define HDI_PTB2 KINETIS_MUX('B',2,8) /* PTB_2 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB_3 */
#define LPSPI1_SOUT_PTB3 KINETIS_MUX('B',3,2) /* PTB_3 */
#define LPUART1_RX_PTB3 KINETIS_MUX('B',3,3) /* PTB_3 */
#define TPM3_CLKIN_PTB3 KINETIS_MUX('B',3,5) /* PTB_3 */
#define HDI_PTB3 KINETIS_MUX('B',3,8) /* PTB_3 */
#define PWM0_X0_PTB3 KINETIS_MUX('B',3,9) /* PTB_3 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB_4 */
#define LPSPI1_PCS3_PTB4 KINETIS_MUX('B',4,2) /* PTB_4 */
#define LPUART1_CTS_b_PTB4 KINETIS_MUX('B',4,3) /* PTB_4 */
#define LPI2C1_SDA_PTB4 KINETIS_MUX('B',4,4) /* PTB_4 */
#define TPM3_CH0_PTB4 KINETIS_MUX('B',4,5) /* PTB_4 */
#define TRGMUX0_IN0_PTB4 KINETIS_MUX('B',4,6) /* PTB_4 */
#define HDI_PTB4 KINETIS_MUX('B',4,8) /* PTB_4 */
#define PWM0_X1_PTB4 KINETIS_MUX('B',4,9) /* PTB_4 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB_5 */
#define LPSPI1_PCS2_PTB5 KINETIS_MUX('B',5,2) /* PTB_5 */
#define LPUART1_RTS_b_PTB5 KINETIS_MUX('B',5,3) /* PTB_5 */
#define LPI2C1_SCL_PTB5 KINETIS_MUX('B',5,4) /* PTB_5 */
#define TPM3_CH1_PTB5 KINETIS_MUX('B',5,5) /* PTB_5 */
#define TRGMUX0_OUT0_PTB5 KINETIS_MUX('B',5,6) /* PTB_5 */
#define HDI_PTB5 KINETIS_MUX('B',5,8) /* PTB_5 */
#define PWM0_X2_PTB5 KINETIS_MUX('B',5,9) /* PTB_5 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC_0 */
#define LPSPI1_PCS2_PTC0 KINETIS_MUX('C',0,2) /* PTC_0 */
#define CAN0_TX_PTC0 KINETIS_MUX('C',0,3) /* PTC_0 */
#define TPM4_CLKIN_PTC0 KINETIS_MUX('C',0,5) /* PTC_0 */
#define LPI2C1_SCL_PTC0 KINETIS_MUX('C',0,7) /* PTC_0 */
#define HDI_PTC0 KINETIS_MUX('C',0,8) /* PTC_0 */
#define LPSPI2_PCS3_PTC0 KINETIS_MUX('C',0,9) /* PTC_0 */
#define PWM0_A0_PTC0 KINETIS_MUX('C',0,11) /* PTC_0 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define LPSPI1_PCS3_PTC1 KINETIS_MUX('C',1,2) /* PTC_1 */
#define CAN0_RX_PTC1 KINETIS_MUX('C',1,3) /* PTC_1 */
#define TPM4_CH0_PTC1 KINETIS_MUX('C',1,5) /* PTC_1 */
#define LPI2C1_SDA_PTC1 KINETIS_MUX('C',1,7) /* PTC_1 */
#define HDI_PTC1 KINETIS_MUX('C',1,8) /* PTC_1 */
#define PWM0_B0_PTC1 KINETIS_MUX('C',1,11) /* PTC_1 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC_2 */
#define LPSPI1_SOUT_PTC2 KINETIS_MUX('C',2,2) /* PTC_2 */
#define LPUART1_RX_PTC2 KINETIS_MUX('C',2,3) /* PTC_2 */
#define LPI2C1_SCLS_PTC2 KINETIS_MUX('C',2,4) /* PTC_2 */
#define TPM4_CH1_PTC2 KINETIS_MUX('C',2,5) /* PTC_2 */
#define HDI_PTC2 KINETIS_MUX('C',2,8) /* PTC_2 */
#define PWM0_A1_PTC2 KINETIS_MUX('C',2,11) /* PTC_2 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define LPSPI1_SCK_PTC3 KINETIS_MUX('C',3,2) /* PTC_3 */
#define LPUART1_TX_PTC3 KINETIS_MUX('C',3,3) /* PTC_3 */
#define LPI2C1_SDAS_PTC3 KINETIS_MUX('C',3,4) /* PTC_3 */
#define TPM0_CLKIN_PTC3 KINETIS_MUX('C',3,5) /* PTC_3 */
#define HDI_PTC3 KINETIS_MUX('C',3,8) /* PTC_3 */
#define PWM0_B1_PTC3 KINETIS_MUX('C',3,11) /* PTC_3 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define LPSPI1_SIN_PTC4 KINETIS_MUX('C',4,2) /* PTC_4 */
#define CAN0_TX_PTC4 KINETIS_MUX('C',4,3) /* PTC_4 */
#define LPI2C1_SCL_PTC4 KINETIS_MUX('C',4,4) /* PTC_4 */
#define TPM0_CH0_PTC4 KINETIS_MUX('C',4,5) /* PTC_4 */
#define HDI_PTC4 KINETIS_MUX('C',4,8) /* PTC_4 */
#define PWM0_A2_PTC4 KINETIS_MUX('C',4,11) /* PTC_4 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define LPSPI1_PCS0_PTC5 KINETIS_MUX('C',5,2) /* PTC_5 */
#define CAN0_RX_PTC5 KINETIS_MUX('C',5,3) /* PTC_5 */
#define LPI2C1_SDA_PTC5 KINETIS_MUX('C',5,4) /* PTC_5 */
#define TPM0_CH1_PTC5 KINETIS_MUX('C',5,5) /* PTC_5 */
#define HDI_PTC5 KINETIS_MUX('C',5,8) /* PTC_5 */
#define PWM0_B2_PTC5 KINETIS_MUX('C',5,11) /* PTC_5 */
#define ADC0_A8_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define LPSPI1_PCS1_PTC6 KINETIS_MUX('C',6,2) /* PTC_6 */
#define HDI_PTC6 KINETIS_MUX('C',6,8) /* PTC_6 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC_7 */
#define TRGMUX0_IN3_PTC7 KINETIS_MUX('C',7,2) /* PTC_7 */
#define TRGMUX0_OUT3_PTC7 KINETIS_MUX('C',7,3) /* PTC_7 */
#define SFA0_CLK_PTC7 KINETIS_MUX('C',7,4) /* PTC_7 */
#define TPM0_CH2_PTC7 KINETIS_MUX('C',7,5) /* PTC_7 */
#define SFA1_CLK_PTC7 KINETIS_MUX('C',7,6) /* PTC_7 */
#define CLKOUT_PTC7 KINETIS_MUX('C',7,7) /* PTC_7 */
#define HDI_PTC7 KINETIS_MUX('C',7,8) /* PTC_7 */
#define NMI_b_PTC7 KINETIS_MUX('C',7,10) /* PTC_7 */
#define ADC0_A12_PTD0 KINETIS_MUX('D',0,0) /* PTD_0 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define RESET_b_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define ADC0_A13_PTD1 KINETIS_MUX('D',1,0) /* PTD_1 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD_1 */
#define SPC0_LPREQ_PTD1 KINETIS_MUX('D',1,2) /* PTD_1 */
#define NMI_b_PTD1 KINETIS_MUX('D',1,3) /* PTD_1 */
#define RF_GPO_4_PTD1 KINETIS_MUX('D',1,4) /* PTD_1 */
#define TPM2_CLKIN_PTD1 KINETIS_MUX('D',1,5) /* PTD_1 */
#define RF_GPO_7_PTD1 KINETIS_MUX('D',1,6) /* PTD_1 */
#define ADC0_A14_PTD2 KINETIS_MUX('D',2,0) /* PTD_2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define LPTMR0_ALT3_PTD2 KINETIS_MUX('D',2,2) /* PTD_2 */
#define TAMPER0_PTD2 KINETIS_MUX('D',2,3) /* PTD_2 */
#define RF_GPO_5_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define TPM2_CH0_PTD2 KINETIS_MUX('D',2,5) /* PTD_2 */
#define LPTMR1_TRIG_OUT_b_PTD2 KINETIS_MUX('D',2,7) /* PTD_2 */
#define ADC0_A15_PTD3 KINETIS_MUX('D',3,0) /* PTD_3 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD_3 */
#define LPTMR1_ALT3_PTD3 KINETIS_MUX('D',3,2) /* PTD_3 */
#define TAMPER1_PTD3 KINETIS_MUX('D',3,3) /* PTD_3 */
#define RF_GPO_6_PTD3 KINETIS_MUX('D',3,4) /* PTD_3 */
#define TPM2_CH1_PTD3 KINETIS_MUX('D',3,5) /* PTD_3 */
#define TRGMUX0_IN2_PTD3 KINETIS_MUX('D',3,6) /* PTD_3 */
#define LPTMR0_TRIG_OUT_b_PTD3 KINETIS_MUX('D',3,7) /* PTD_3 */
#define XTAL32K_PTD4 KINETIS_MUX('D',4,0) /* PTD_4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define LPTMR0_ALT2_PTD4 KINETIS_MUX('D',4,2) /* PTD_4 */
#define TAMPER2_PTD4 KINETIS_MUX('D',4,3) /* PTD_4 */
#define LPSPI2_PCS1_PTD4 KINETIS_MUX('D',4,9) /* PTD_4 */
#define EXTAL32K_PTD5 KINETIS_MUX('D',5,0) /* PTD_5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD_5 */
#define LPTMR1_ALT2_PTD5 KINETIS_MUX('D',5,2) /* PTD_5 */
#define LPSPI2_PCS2_PTD5 KINETIS_MUX('D',5,9) /* PTD_5 */
#endif
